# Primitive Data Type
# Number , Boolean , String

# Non-Primitive Data Type / Collection / Data Structure ข้อมูลชนิดไม่พื้นฐาน
# List , Tuple , Set , Dictionary

# Data type จะเอามาใช้กับการเขียนโปรเเกรมในเรื่องของ ตัวเเปร พารามิเตอร์ ฟังก์ชัน เมธอด

# ------------ List คือ ข้อมูลหลายข้อมูล คนละชนิด ซํ้ากันได้ เเละมีลำดับ อีกทั้งเเก้ไขได้ด้วย ---------------
          #0   1   2   3   4       5   บวก   ------>
listgu1 = [10,20,True,10,"Hee",[20,"Mee"]]  
          #-6  -5  -4  -3  -2      -1  ติดลบ  <-----
        
# ------------ Tuple คือ ข้อมูลหลายข้อมูล คนละชนิด ซํ้ากันได้ เเละมีลำดับ เเต่เเก้ไขไม่ได้ เพิ่ม-ลบก็ไม่ได้---------------
          #0   1   2   3   4       5   บวก   ------>
tuplegu1 = (10,20,True,10,"Hee",(20,"Mee")) #ใช้วงเล็บเเทนกล้ามปู 
          #-6  -5  -4  -3  -2      -1  ติดลบ  <-----

# ------------ Set คือ ข้อมูลหลายข้อมูล คนละชนิด ซํ้ากันไม่ได้(ถ้าถือว่าเป็นตัวเดียวกัน) เเละไม่มีลำดับ เเละเเก้ไขไม่ได้ เเต่เพิ่ม-ลบได้ ---------------
setgu1 = {10,20,True,10,"Hee",(20,"Mee")} #ใช้ปีกกา (ไม่ใส่เลขเพราะไม่มีลำดับ) "set อยู่ใน set ไม่ได้ มีเเต่ tuple เท่านั้นที่อยู่ได้"
